coq/aula14.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-01 sex 14:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Aula 14 - Lógica em Coq 2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rafael Castro - rafaelcgs10.github.io/coq" />
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Aula 14 - Lógica em Coq 2</h1>


<div id="outline-container-org4fe6753" class="outline-2">
<h2 id="org4fe6753"><span class="section-number-2">1</span> Equivalência lógica</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeaf2cad" class="outline-3">
<h3 id="orgeaf2cad"><span class="section-number-3">1.1</span> Equivalência lógica</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Uma equivalência lógica acontece quando duas proposições são verdadeiras para a mesma valoração.</li>
<li>Conhecido como "se, e somente se,".</li>
<li>É apenas uma conjunção de implicações</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Module</span> <span style="color: #93E0E3;">MyIff</span>.

<span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">iff</span> (<span style="color: #DFAF8F;">P Q</span> : <span style="color: #7CB8BB;">Prop</span>) := (P -&gt; Q) /\ (Q -&gt; P).

<span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"P &lt;-&gt; Q"</span> := (iff P Q)
                      (<span style="color: #7CB8BB;">at</span> level 95, no associativity)
                      : type_scope.

<span style="color: #F0DFAF; font-weight: bold;">End</span> <span style="color: #93E0E3;">MyIff</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org0cdc60c" class="outline-3">
<h3 id="org0cdc60c"><span class="section-number-3">1.2</span> Exemplo de equivalência</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Se <i>P</i> e <i>Q</i> são equivalentes, então <i>Q</i> e <i>P</i> são equivalentes.</li>
<li>Como a bi-implicação é apenas uma conjunção, utiliza-se <i>split</i>.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">iff_sym</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">P Q</span> : <span style="color: #7CB8BB;">Prop</span>,
  (P &lt;-&gt; Q) -&gt; (Q &lt;-&gt; P).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> P Q [HAB HBA].
  <span style="color: #BFEBBF; background-color: #3F3F3F;">split</span>.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">-&gt; </span><span style="color: #5F7F5F;">*)</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> HBA.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">&lt;- </span><span style="color: #5F7F5F;">*)</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> HAB.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7a9ce5e" class="outline-2">
<h2 id="org7a9ce5e"><span class="section-number-2">2</span> Quantificação Existencial</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1678950" class="outline-3">
<h3 id="org1678950"><span class="section-number-3">2.1</span> Quantificação existencial no objetivo</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Para dizer que existe um <i>x</i> de tipo <i>T</i>, tal que alguma propriedade <i>P</i> é verdade para <i>x</i>, escreve-se: <i>exist x : T, P</i>.</li>
<li>Utiliza-se o quantificador <i>exists</i> de maneira similar ao <i>forall</i>.</li>
<li>A tática <i>exists</i> escolhe qual elemento existe.</li>
<li>Exemplo de prova de existência:</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Lemma</span> <span style="color: #93E0E3;">four_is_even</span> : <span style="color: #BFEBBF; background-color: #3F3F3F;">exists</span> <span style="color: #DFAF8F;">n</span> : nat, 4 = n + n.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">exists</span> 2. 
  <span style="color: #BFEBBF;">reflexivity</span>.
<span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org4cdc8f6" class="outline-3">
<h3 id="org4cdc8f6"><span class="section-number-3">2.2</span> Quantificação existencial nas hipóteses</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Se há uma hipótese que afirma uma existencia <i>exists x, Px</i>, pode-se utilizar <i>destruct</i> para obter as hipóteses <i>x</i> e <i>P</i> sobre <i>x</i>.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">exists_example_2</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">n</span>,
  (<span style="color: #BFEBBF; background-color: #3F3F3F;">exists</span> <span style="color: #DFAF8F;">m</span>, n = 4 + m) -&gt;
  (<span style="color: #BFEBBF; background-color: #3F3F3F;">exists</span> <span style="color: #DFAF8F;">o</span>, n = 2 + o).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> n Hm.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">destruct</span> Hm <span style="color: #7CB8BB;">as</span> [m H].
  <span style="color: #BFEBBF; background-color: #3F3F3F;">exists</span> (2 + m).
  <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> H.  <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d8e9b0" class="outline-3">
<h3 id="org8d8e9b0"><span class="section-number-3">2.3</span> Definição do tipo existencial</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>O tipo existencial é uma proposição definida indutivamente.</li>
<li>O tipo existencial é parametrizado por um tipo <i>A</i> (implicíto) e uma função <i>P : A -&gt; Prop</i> que é proposição quantificada.</li>
<li>O <i>forall</i> é um parâmetro do construtor, não do tipo.</li>
<li>A tática <i>exists</i> é apenas um <i>apply</i> com o construtor.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Section</span> <span style="color: #93E0E3;">MyEx</span>.
   <span style="color: #F0DFAF; font-weight: bold;">Inductive</span> <span style="color: #93E0E3;">ex</span> {<span style="color: #DFAF8F;">A</span> : <span style="color: #7CB8BB;">Type</span>} (<span style="color: #DFAF8F;">P</span> : A -&gt; <span style="color: #7CB8BB;">Prop</span>) : <span style="color: #7CB8BB;">Prop</span> :=
    ex_intro : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">x</span> : A, P x -&gt; ex P. 

   <span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">exemple_ex</span> : ex (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">n</span> : nat =&gt; n = n).
     <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> ex_intro <span style="color: #7CB8BB;">with</span> (x:=1).
     <span style="color: #BFEBBF;">reflexivity</span>.
    <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org81e1df9" class="outline-3">
<h3 id="org81e1df9"><span class="section-number-3">2.4</span> Notação do tipo existencial</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Notation</span> <span style="color: #CC9393;">"'existss' x .. y , p"</span> := (ex (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">x</span> =&gt; .. (ex (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">y</span> =&gt; p)) ..))
  (<span style="color: #7CB8BB;">at</span> level 200, x binder, <span style="color: #BFEBBF; background-color: #3F3F3F;">right</span> associativity,
   format <span style="color: #CC9393;">"'[' 'existss' '/ ' x .. y , '/ ' p ']'"</span>).

   <span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">exemple_ex2</span> : existss n : nat, n = n.
     <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> ex_intro <span style="color: #7CB8BB;">with</span> (x:=1).
     <span style="color: #BFEBBF;">reflexivity</span>.
   <span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
<span style="color: #F0DFAF; font-weight: bold;">End</span> <span style="color: #93E0E3;">MyEx</span>.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4a2d9ef" class="outline-2">
<h2 id="org4a2d9ef"><span class="section-number-2">3</span> Coq vs Teoria dos Conjuntos</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbf709d5" class="outline-3">
<h3 id="orgbf709d5"><span class="section-number-3">3.1</span> Coq vs Teoria dos Conjuntos</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>A fundação da matemática tradocional, com papel e cante, é a Teoria dos Conjuntos (ZFC).</li>
<li>Um objeto matemática pode ser membro de vários conjuntos em ZFC, porém em Coq um termo é membro de no máximo um tipo.</li>
<li>Isso, em geral, não é um problema: em ZFC o número dois é membro do conjuntos do naturais em do números pares; em Coq o número dois é membro do tipo <i>nat</i> e tem-se que <i>ev 2</i> é verdade, onde <i>ev : nat -&gt; Prop</i> é uma propriedade que descreve números pares.</li>
<li>Mas há situações onde é interessante adiconar axiomas.</li>
</ul>
</div>
</div>

<div id="outline-container-org59322d7" class="outline-3">
<h3 id="org59322d7"><span class="section-number-3">3.2</span> Princípio da Extensionalidade</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Duas funções são iguais se tem o mesmo mapeamento (forall x, f x = g x) -&gt; f = g.</li>
<li>Esse princípio não faz parte do Coq. Se desejamos, precisamos adicionar.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">function_equality_ex2</span> :
  (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">x</span> =&gt; plus x 1) = (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">x</span> =&gt; plus 1 x).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
   <span style="color: #5F7F5F;">(* </span><span style="color: #7F9F7F;">Stuck </span><span style="color: #5F7F5F;">*)</span>
<span style="color: #F0DFAF; font-weight: bold;">Abort</span>.
</pre>
</div>
</div>
</div>

<div id="outline-container-org0b9fa6e" class="outline-3">
<h3 id="org0b9fa6e"><span class="section-number-3">3.3</span> Princípio da Extensionalidade</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Utilizar o comando <i>Axiom</i> tem o mesmo efeito de enunciar um teorema e pular a prova com <i>Admitted</i>.</li>
<li>Obviamente deve-se ser cuidadoso ao adicionar axiomas ao Coq, pois deixar o sistema inconsistente.</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Axiom</span> <span style="color: #DFAF8F;">functional_extensionality</span> : <span style="color: #7CB8BB;">forall</span> {<span style="color: #DFAF8F;">X Y</span>: <span style="color: #7CB8BB;">Type</span>}
                                    {<span style="color: #DFAF8F;">f g</span> : X -&gt; Y},
  (<span style="color: #7CB8BB;">forall</span> (<span style="color: #DFAF8F;">x</span>:X), f x = g x) -&gt; f = g.

<span style="color: #F0DFAF; font-weight: bold;">Example</span> <span style="color: #93E0E3;">function_equality_ex2</span> :
  (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">x</span> =&gt; plus x 1) = (<span style="color: #7CB8BB;">fun</span> <span style="color: #DFAF8F;">x</span> =&gt; plus 1 x).
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> functional_extensionality. <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> x.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> plus_comm.
<span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org97c3c10" class="outline-2">
<h2 id="org97c3c10"><span class="section-number-2">4</span> Lógica Clássica vs Lógica Construtivista</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org88ef316" class="outline-3">
<h3 id="org88ef316"><span class="section-number-3">4.1</span> Lógica Clássica vs Lógica Construtivista</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>A Lógica Clássica tem como tautologia P \/ ~P, conhecido como Axioma do Terceiro Excluído.</li>
<li>E se não for possível demonstrar P e nem ~P? Ex: e se P for verdade, mas sem prova (proposição indecídivel).</li>
<li>A Lógica Construtivista não toma como sempre verdade o terceiro excluído.</li>
<li>Não há como provar o terceiro excluído em Coq!</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Definition</span> <span style="color: #93E0E3;">excluded_middle</span> := <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">P</span> : <span style="color: #7CB8BB;">Prop</span>,
  P \/ ~ P.
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1f9cd0" class="outline-3">
<h3 id="orge1f9cd0"><span class="section-number-3">4.2</span> Terceiro excluído pode ser verdade</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>Há casos onde o terceiro excluído é verdade em Coq:</li>
</ul>
<div class="org-src-container">
<pre class="src src-coq"><span style="color: #F0DFAF; font-weight: bold;">Theorem</span> <span style="color: #93E0E3;">restricted_excluded_middle</span> : <span style="color: #7CB8BB;">forall</span> <span style="color: #DFAF8F;">P b</span>,
  (P &lt;-&gt; b = true) -&gt; P \/ ~ P.
<span style="color: #F0DFAF; font-weight: bold;">Proof</span>.
  <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> P [] H.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">left</span>. <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> H. <span style="color: #BFEBBF;">reflexivity</span>.
  <span style="color: #F0DFAF; font-weight: bold; text-decoration: underline;">-</span> <span style="color: #BFEBBF; background-color: #3F3F3F;">right</span>. <span style="color: #BFEBBF; background-color: #3F3F3F;">unfold</span> not. <span style="color: #BFEBBF; background-color: #3F3F3F;">intros</span> HP. <span style="color: #BFEBBF; background-color: #3F3F3F;">apply</span> H <span style="color: #7CB8BB;">in</span> HP <span style="color: #7CB8BB;">as</span> contra. 
    <span style="color: #BFEBBF; background-color: #3F3F3F;">inversion</span> contra.
<span style="color: #F0DFAF; font-weight: bold;">Qed</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 06/06/2018</p>
<p class="author">Author: Rafael Castro - rafaelcgs10.github.io/coq</p>
<p class="date">Created: 2018-06-01 sex 14:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
